Revit 2027 API
Parameter.AsValueString(FormatOptions) Method
Get the parameter value as a string with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsValueString(
	FormatOptions formatOptions
)
Public Function AsValueString (
	formatOptions As FormatOptions
) As String
public:
String^ AsValueString(
	FormatOptions^ formatOptions
)
member AsValueString :
        formatOptions : FormatOptions -> string
Parameters
formatOptions FormatOptions
Options for formatting the string.
Return Value
String
The string that represents the parameter value.
See Also
Reference
Parameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace